



# 작업 status
porocess_status = {
    '프로젝트 대기' : 'A',
    '프로젝트 진행' : 'B',
    '프로젝트 완료' : 'C',
    '프로젝트 취소' : 'D',
    # '' : 'E'
    '작업 대기' : 'F',
    '작업 진행' : 'G',
    '작업 완료' : 'H',
    '작업 취소' : 'I',
    # '' : 'J'
    '1차 검수 대기' : 'K',
    '1차 검수 진행' : 'L',
    '1차 검수 완료' : 'M',
    '1차 검수 취소' : 'N',
    # '' : 'O'
    '2차 검수 대기' : 'P',
    '2차 검수 진행' : 'Q',
    '2차 검수 완료' : 'R',
    '2차 검수 취소' : 'S',
    # '' : 'T'
    '3차 검수 대기' : 'U',
    '3차 검수 진행' : 'V',
    '3차 검수 완료' : 'W',
    '3차 검수 취소' : 'X'
    # '' : 'Y'
    # '' : 'Z'
}




# 기록 status
record_status = {
    '작업 신청' : 'AA',
    '작업 완료' : 'AB',
    '작업 취소' : 'AC',
    '작업 반려' : 'AD',
    # 'AE'
    '1차 검수 신청' : 'AF',
    '1차 검수 완료' : 'AG',
    '1차 검수 취소' : 'AH',
    '1차 검수 반려' : 'AI',
    # 'AJ'
    '2차 검수 신청' : 'AK',
    '2차 검수 완료' : 'AL',
    '2차 검수 취소' : 'AM',
    '2차 검수 반려' : 'AN',
    # 'AO'
    '3차 검수 신청' : 'AP',
    '3차 검수 완료' : 'AQ',
    '3차 검수 취소' : 'AR',
    '3차 검수 반려' : 'AS'
	# 'AT'
	# 'AU'
	# 'AV'
	# 'AW'
	# 'AX'
	# 'AY'
	# 'AZ'

}


# 반려 status
deny_status = {
    '1차 검수 반려' : 'BA',
    '2차 검수 반려' : 'BB',
    '3차 검수 반려' : 'BC'
	# BD
	# BE
	# BF
	# BG
}



# 금액 status
pay_status = {
    '작업' : 'CA',
    '1차 검수' : 'CB',
    '2차 검수' : 'CC',
    '3차 검수' : 'CD'
}

 # 작업 status
work_status = {
    '작업 대기': 'A',
    '작업 진행': 'B',
    '1차 검수 대기': 'C',
    '1차 검수 진행': 'D',
    '2차 검수 대기': 'E',
    '2차 검수 진행': 'F',
    '3차 검수 대기': 'G',
    '3차 검수 진행': 'H',
    '작업 5완료': 'I',
    '1차 검수 반려': 'R1',
    '2차 검수 반려': 'R2',
    '3차 검수 반려': 'R3',
    '작업취소' : 'R4',
    '1차 검수 취소' : 'J',
    '2차 검수 취소' : 'K',
    '3차 검수 취소' : 'H'

}
